((a) => {
    console.log(a);
})(123)
console.log("====================================================");
// for (var i = 0; i < 5; i++) {
//     setTimeout(() => {
//         console.log(i++);
//     }, 5000) //这是有5个任务给挂起了
// }

for (var j = 0; j < 5; j++) {

    var q = (a) => {
        setTimeout(() => {
            console.log(a);
        }, 5000);
    }

    q(j); // 也可以使用立即执行函数
    ((a) => {
        setTimeout(() => {
            console.log(a);
        }, 5000);
    })(j)


}

//简单点理解就是,第一种是将settimeout的5个任务扔到队列,但未参与运算所以等全局执行完了再参与运算
//第二种也是将5个任务扔到队列,但是这五个任务外有外部变量,分别挂起为fn(0),fn(1),fn(2),fn(3),fn(4),第二种好像有点点闭包的意思了.